{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}plog_768
       {txt}log:  {res}/Users/sreyamajumder/Dropbox/sreya_majumder/tribelanguage_2020 sreya/02_scripts/1.01b_apply_district_codes_to_census61_language_data.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Sep 2021, 20:07:14
{txt}
{com}. *************************************************************************************************************************
. * this file takes the census1961 mothertongue data and codes its districts
. * districts are coded as per census60.csv
. *************************************************************************************************************************
. 
. project , original("../01_data/census_boundaries_data/District Boundary Changes 1961-2011.xlsx")
{txt}project version2_tribe_language > do-file uses original: {res}"01_data/census_boundaries_data/District Boundary Changes 1961-2011.xlsx" filesig(262706738:905247){txt}

{com}. project , uses("../08_temp/census1961_st_mothertongue.dta")
{txt}project version2_tribe_language > do-file uses: {res}"08_temp/census1961_st_mothertongue.dta" filesig(1104297003:25208159){txt}

{com}. 
. 
. import excel using "../01_data/census_boundaries_data/District Boundary Changes 1961-2011.xlsx", sheet("census1961") firstrow case(lower) clear
{res}{text}(5 vars, 376 obs)

{com}. 
. 
. 
. rename *1961 *_1961
{res}{txt}
{com}. 
. tempfile census61
{txt}
{com}. save `census61'
{txt}{p 0 4 2}
file {bf}
/var/folders/m0/4lyk4gcd0rs88ghc7sdnwc600000gn/T//S_13929.000006{rm}
saved
as .dta format
{p_end}

{com}. 
. ************************************************************************************************************************
. * 2. fix states and districts in 1961 ST language data, and give them codes 
. ************************************************************************************************************************
. 
. use "../08_temp/census1961_st_mothertongue", clear
{txt}
{com}. 
. drop if strpos(district," Division")>0
{txt}(3,055 observations deleted)

{com}. 
. 
. rename state state_1961
{res}{txt}
{com}. rename district district_1961
{res}{txt}
{com}. 
. * there is no point keeping those areas of Andamans, Laccadives, Tripura and Manipur that are not "districts" in our district-boundaries data
. drop if district_1961 ~= "Andaman & Nicobar Islands" & state_1961 == "Andaman & Nicobar Islands"
{txt}(11 observations deleted)

{com}. drop if district_1961 ~= "Tripura" & state_1961 == "Tripura"
{txt}(592 observations deleted)

{com}. drop if inlist(district_1961,"Mao","Sadar Hills") & state_1961 == "Manipur"
{txt}(39 observations deleted)

{com}. drop if district_1961 ~= "Laccadive, Minicoy and Amindivi Islands" & state_1961 == "Laccadive, Minicoy and Amindivi Islands"
{txt}(17 observations deleted)

{com}. 
. * for A&N,Tripura, Dadra Nagar Haveli and Laccadives we need to create a new "district" [same as the state]
. expand 2 if inlist(state_1961,"Andaman & Nicobar Islands","Tripura","Laccadive, Minicoy and Amindivi Islands","Dadra and Nagar Haveli"), gen(dist_obs)
{txt}(218 observations created)

{com}. replace district_1961 = district_1961 + " District" if dist_obs
{txt}variable {bf}{res}district_1961{sf}{txt} was {bf}{res}str39{sf}{txt} now {bf}{res}str48{sf}
{txt}(218 real changes made)

{com}. replace dcode = dcode + 1 if dist_obs
{txt}(218 real changes made)

{com}. drop dist_obs  
{txt}
{com}. 
. * for Laccadives we need to create another set of observations with "all scheduled tribes" as the tribe
. expand 2 if state_1961 == "Laccadive, Minicoy and Amindivi Islands", gen(lacca_obs)
{txt}(10 observations created)

{com}. replace tribe = "all scheduled tribes" if lacca_obs
{txt}(10 real changes made)

{com}. replace tribe_code = 196132500 if lacca_obs
{txt}(10 real changes made)

{com}. drop lacca_obs
{txt}
{com}. 
. merge m:1 state_1961 district_1961 using `census61', assert(match using) keep(match)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}          13,922{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. * in some states, there were no STs delimited in 1961: Delhi, J&K, Pondicherry, Sikkim, UP
. * in Punjab, no STs were delimited outside of the hilly parts that later went to HP
. * in Goa, no info was collected on SCs and STs in 1961
. * we have found no SC/ST volume for NEFA [Arunachal Pradesh] in 1961
. 
. drop if _merge~=3
{txt}(0 observations deleted)

{com}. assert dcode == dcode_1961
{txt}
{com}. drop _merge dcode is_not_division sort_code
{txt}
{com}. 
. order dcode_1961 state_1961 district_1961 area_1961 pop_1961
{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. 
. save "../08_temp/census1961_st_mothertongue_distcoded", replace
{txt}{p 0 4 2}
file {bf}
../08_temp/census1961_st_mothertongue_distcoded.dta{rm}
saved
{p_end}

{com}. 
. project , creates("../08_temp/census1961_st_mothertongue_distcoded.dta")
{txt}project version2_tribe_language > do-file creates: {res}"08_temp/census1961_st_mothertongue_distcoded.dta" filesig(3162696187:20487697){txt}

{com}.  
. 
{txt}end of do-file
      name:  {res}plog_768
       {txt}log:  {res}/Users/sreyamajumder/Dropbox/sreya_majumder/tribelanguage_2020 sreya/02_scripts/1.01b_apply_district_codes_to_census61_language_data.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 6 Sep 2021, 20:07:16
{txt}{.-}
{smcl}
{txt}{sf}{ul off}